from django.db import models
from myapp.models import UserAccount
from jalali_date import date2jalali, datetime2jalali


class Document(models.Model):
    # عنوان لایحه
    title = models.CharField(max_length=255)

    # متن کامل لایحه
    text = models.TextField(null=True)
    SUBJECT_CHOICES = [
        ('madde1',
         'ماده 1 - معارفه هیأت مرکزی به وزارت کشور'),
        ('madde2',
         'ماده 2 -انتخاب وزارت کشور به عنوان محل کار توسط هیأت مرکزی و انتخاب استانداری ها,فرمانداری ها یا بخش داری ها به عنوان محل کار توسط هیأت های نظارت استان و حوزه های انتخابیه'),
        ('madde3',
         'ماده 3 - هیأت مرکزی بر کلیه مراحل انتخابات و اقدامات وزارت کشور نظارت خواهد کرد.'),
        ('madde4',
         'ماده 4 - دستورالعمل اجرایی برگزاری انتخابات مجلس شورای اسلامی توسط وزارت کشور تهیه و با تصویب شورای نگهبان به اجرا درمی‌آید.'),
        ('madde5',
         'ماده 5 - هیأت مرکزی نظارت در سراسر کشور و هیأت‌های نظارت پنج‌نفری در تهران و استان‌ها، بر کیفیت انتخابات نظارت دارند.'),
        ('madde6',
         'ماده 6 - نظارت بر انتخابات از طریق گزارش‌های وزارت کشور، بازرسی‌های مستقل، بررسی شکایات و تعیین ناظر صورت می‌گیرد.'),
        ('madde7',
         'ماده 7 - تعیین هیأت‌ 5 نفره با شرایط مذکور در ماده ی یک توسط هیأت‌ مرکزی نظارت بر انتخابات.'),
        ('madde8',
         'ماده 8 - معرفی سه نفر با شرایط مذکور در ماده یک توسط هیأت‌ نظارت استان برای حوزه های انتحابیه'),
        ('madde9',
         'ماده 9 - هیأت‌های سه‌نفری موظفند افراد واجد شرایط را برای نظارت بر حوزه‌های فرعی انتخاب کنند.'),
        ('madde10',
         'ماده 10 - هیأت مرکزی نظارت موطفند قبل از هرگونه شکایت، گزارش‌های وزارت کشور و هیأت‌های شورا را بررسی کرده.'),
        ('madde11',
         'ماده 11 -هیأت مرکزی موظف است مدارک حاکی از لزوم توقف انتخابات را برای شورای نگهبان بفرستد و مستفیما حق ابطال انتخابات را ندارد'),
        ('madde12',
         'ماده 12 - چنانچه تخلفاتی مشاهده شود، شورای نگهبان موظف است مراتب را برای توقف انتخابات به وزارت کشور ارائه کند.'),
        ('madde13',
         'ماده 13 - وزارت کشور موظف است انتخابات مجدد را با تأیید شورای نگهبان برگزار کند.'),
        ('madde14',
         'ماده 14 - هرگونه اقدام در رابطه با ابطال یا توقف انتخابات بدون رای شورای نگهبان اعتبار  قانونی ندارد.'),
        ('madde15',
         'ماده 15 - نتایج تخلفات انتخاباتی توسط هیأت های سه نفره بررسی شده و در صورت لزوم به مقامات مربوطه گزارش داده می‌شود.'),
        ('madde16',
         'ماده 16 - صورت‌جلسات و اقدامات باید به وزارت کشور و هیأت‌های نظارتی ارسال شوند.'),
        ('madde17',
         'ماده 17 - تعیین اختیارات بازرسان هیأت پنج نفره طبق قانون انتخابات تعیین شده است.'),
        ('madde18',
         'ماده 18 - هزینه نظارت از محل هزینه‌های انتخابات مجلس پرداخت می‌شود.'),
        ('madde19',
         'ماده 19 - یک ماه پیش از شروع انتخابات، وزارت کشور موظف است تأیید شورای نگهبان را بگیرد.'),
        ('madde20',
         'ماده 20 - هر قانونی که با نظارت شورای نگهبان معارض باشد، اعتبار قانونی ندارد.'),
    ]

    subject = models.CharField(max_length=10, choices=SUBJECT_CHOICES, default='Chois')
    # وضعیت لایحه: در حال بررسی، تایید شده، رد شده و غیره
    STATUS_CHOICES = (
        ('pending', 'در حال بررسی'),
        ('approved', 'تایید شده'),
        ('rejected', 'رد شده'),
    )

    status = models.CharField(max_length=10, choices=STATUS_CHOICES, default='pending')

    # کاربری که لایحه را نوشته است (ارتباط با مدل User)
    user = models.ForeignKey(UserAccount, on_delete=models.CASCADE)

    Letterattachment = models.FileField(upload_to='documents/Letterattachment/')

    # تاریخ ثبت لایحه
    created_at = models.DateTimeField(auto_now_add=True)

    def __str__(self):
        return self.title

    def get_jalali_date(self):
        return date2jalali(self.created_at)

    class Meta:
        ordering = ['-created_at']  # نمایش لایحه‌ها به ترتیب تاریخ ثبت


class assembly(models.Model):
    # عنوان لایحه
    title = models.CharField(max_length=255)

    # متن کامل لایحه
    text = models.TextField(null=True)
    SUBJECT_CHOICES = [
        ('madde1',
         'ماده 1 - پنج نفر از افراد مسلمان، مطلع و مورد اعتماد به عنوان هیأت مرکزی نظارت بر انتخابات توسط شورای نگهبان انتخاب شده و به وزارت کشور معرفی می‌شوند. حداقل یک نفر از این افراد باید عضو شورای نگهبان باشد.'),
        ('madde2',
         'ماده 2 - هیأت مرکزی نظارت می‌تواند در وزارت کشور مستقر شود. همچنین، هیأت‌های نظارت در سطح استان‌ها و حوزه‌های انتخابیه می‌توانند در استانداری‌ها، فرمانداری‌ها یا بخشداری‌ها مستقر شوند.'),
        ('madde3',
         'ماده 3 - هیأت مرکزی نظارت بر کلیه مراحل انتخابات، اقدامات وزارت کشور و تشخیص صلاحیت نامزدها نظارت خواهد کرد.'),
        ('madde4',
         'ماده 4 - دستورالعمل اجرایی برگزاری انتخابات مجلس شورای اسلامی توسط وزارت کشور تهیه و با تصویب شورای نگهبان به اجرا درمی‌آید.'),
        ('madde5',
         'ماده 5 - هیأت مرکزی نظارت در سراسر کشور و هیأت‌های نظارت پنج‌نفری در تهران و استان‌ها، بر کیفیت انتخابات نظارت دارند. در صورت تخلف، ستاد انتخابات و فرمانداران موظف به رفع نواقص هستند.'),
        ('madde6',
         'ماده 6 - نظارت بر انتخابات از طریق گزارش‌های وزارت کشور، بازرسی‌های مستقل، بررسی شکایات و تعیین ناظر صورت می‌گیرد. همچنین، شورای نگهبان می‌تواند از کارمندان دولت برای نظارت استفاده کند.'),
        ('madde7',
         'ماده 7 - هیأت نظارت هر استان باید یک هیأت پنج‌نفری برای نظارت بر انتخابات تعیین کند. نظرات این هیأت قطعی است، مگر در مواردی خاص مانند ابطال کل انتخابات یک حوزه.'),
        ('madde8',
         'ماده 8 - هیأت نظارت باید در هر حوزه انتخابیه سه نفر برای نظارت بفرستد. در استان‌هایی که انتخابات فقط در یک حوزه برگزار می‌شود، ضرورت ندارد.'),
        ('madde9', 'ماده 9 - هیأت‌های سه‌نفری موظفند افراد واجد شرایط را برای نظارت بر حوزه‌های فرعی انتخاب کنند.'),
        ('madde10',
         'ماده 10 - هیأت مرکزی نظارت بدون نیاز به شکایت، گزارش‌های وزارت کشور و هیأت‌های شورا را بررسی کرده و بر انتخابات نظارت می‌کند.'),
        ('madde11',
         'ماده 11 - هیأت مرکزی نظارت حق ابطال یا توقف انتخابات ندارد، اما مدارک تخلف را برای شورای نگهبان ارسال خواهد کرد.'),
        ('madde12',
         'ماده 12 - چنانچه تخلفاتی مشاهده شود، شورای نگهبان می‌تواند مراتب را برای توقف انتخابات به وزارت کشور اعلام کند.'),
        ('madde13',
         'ماده 13 - وزارت کشور موظف است انتخابات مجدد را با تأیید شورای نگهبان در حوزه‌های متوقف یا باطل شده برگزار کند.'),
        ('madde14', 'ماده 14 - نظر شورای نگهبان در مورد ابطال یا توقف انتخابات قطعی و لازم‌الاجرا است.'),
        ('madde15', 'ماده 15 - نتایج تخلفات انتخاباتی بررسی شده و در صورت لزوم به مقامات مربوطه گزارش داده می‌شود.'),
        ('madde16',
         'ماده 16 - صورت‌جلسات و اقدامات باید به وزارت کشور و هیأت‌های نظارتی ارسال شوند و الزاما با امضای هیأت نظارت شورای نگهبان همراه باشند.'),
        ('madde17', 'ماده 17 - اختیارات بازرسان هیأت نظارت پنج‌نفری بر اساس قانون انتخابات است.'),
        ('madde18', 'ماده 18 - هزینه نظارت از محل هزینه‌های انتخابات پرداخت می‌شود.'),
        ('madde19', 'ماده 19 - یک ماه پیش از شروع انتخابات، وزارت کشور باید تأیید شورای نگهبان را بگیرد.'),
        ('madde20', 'ماده 20 - هر قانونی که با نظارت شورای نگهبان معارض باشد، اعتبار قانونی ندارد.'),
    ]
    subject = models.CharField(max_length=10, choices=SUBJECT_CHOICES, default='Chois')
    # وضعیت لایحه: در حال بررسی، تایید شده، رد شده و غیره
    STATUS_CHOICES = (
        ('pending', 'در حال بررسی'),
        ('approved', 'تایید شده'),
        ('rejected', 'رد شده'),
    )

    status = models.CharField(max_length=10, choices=STATUS_CHOICES, default='pending')

    # کاربری که لایحه را نوشته است (ارتباط با مدل User)
    user = models.ForeignKey(UserAccount, on_delete=models.CASCADE)

    Letterattachment = models.FileField(upload_to='documents/Letterattachment/')

    # تاریخ ثبت لایحه
    created_at = models.DateTimeField(auto_now_add=True)

    def __str__(self):
        return self.title

    def get_jalali_date(self):
        return date2jalali(self.created_at)
